compagnia-aerea/server/aircompany.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="AirCompanyService.wsdl" xmlns:xsd1="AirCompanyService.xsd" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="AirCompanyService.wsdl" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
    <xs:schema targetNamespace="AirCompanyService.xsd" xmlns:sch="AirCompanyService.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:element name="confirmPurchase"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:complexType name="Preference"><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="departureCountry" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="preferenceID" type="xs:int"/><xs:element maxOccurs="1" minOccurs="1" name="fromTimestamp" type="xs:long"/><xs:element maxOccurs="1" minOccurs="0" name="departureCity" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="maxPrice" type="xs:double"/><xs:element maxOccurs="1" minOccurs="0" name="arrivalCity" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="toTimestamp" type="xs:long"/><xs:element maxOccurs="1" minOccurs="1" name="arrivalCountry" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="searchOffers"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="preferences" type="sch:Preference"/></xs:sequence></xs:complexType></xs:element><xs:complexType name="Offer"><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="departureCountry" type="xs:string"/><xs:element maxOccurs="1" minOccurs="0" name="preferenceID" type="xs:int"/><xs:element maxOccurs="1" minOccurs="1" name="airportID" type="xs:int"/><xs:element maxOccurs="1" minOccurs="1" name="departureCity" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="price" type="xs:double"/><xs:element maxOccurs="1" minOccurs="1" name="offerID" type="xs:int"/><xs:element maxOccurs="1" minOccurs="1" name="arrivalCity" type="xs:string"/><xs:element maxOccurs="1" minOccurs="1" name="seats" type="xs:int"/><xs:element maxOccurs="1" minOccurs="1" name="timestamp" type="xs:long"/><xs:element maxOccurs="1" minOccurs="1" name="arrivalCountry" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="searchOffersResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="offers" type="sch:Offer"/></xs:sequence></xs:complexType></xs:element><xs:element name="availableSeats"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="offerID" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="availableSeatsResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="availableSeats" type="xs:int"/><xs:element maxOccurs="1" minOccurs="1" name="seats" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="cancelPurchase"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="purchaseOffer"><xs:complexType><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="offerID" type="xs:int"/><xs:element maxOccurs="1" minOccurs="1" name="seats" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:complexType name="Ticket"><xs:sequence><xs:element maxOccurs="1" minOccurs="1" name="id" type="xs:int"/></xs:sequence></xs:complexType><xs:element name="purchaseOfferResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="ticket" type="sch:Ticket"/><xs:element maxOccurs="1" minOccurs="1" name="sid" type="xs:string"/></xs:sequence></xs:complexType></xs:element></xs:schema>
  </wsdl:types>
  <wsdl:message name="AvailableSeatsResponse">
    <wsdl:part name="body" element="xsd1:availableSeatsResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="PurchaseOfferResponse">
    <wsdl:part name="body" element="xsd1:purchaseOfferResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="CancelPurchaseMessage">
    <wsdl:part name="body" element="xsd1:cancelPurchase">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="SearchOffersRequest">
    <wsdl:part name="body" element="xsd1:searchOffers">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="PurchaseOfferRequest">
    <wsdl:part name="body" element="xsd1:purchaseOffer">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="SearchOffersResponse">
    <wsdl:part name="body" element="xsd1:searchOffersResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="ConfirmPurchaseMessage">
    <wsdl:part name="body" element="xsd1:confirmPurchase">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="AvailableSeatsRequest">
    <wsdl:part name="body" element="xsd1:availableSeats">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="AirCompanyPort">
    <wsdl:operation name="confirmPurchase">
      <wsdl:input message="tns:ConfirmPurchaseMessage">
    </wsdl:input>
    </wsdl:operation>
    <wsdl:operation name="searchOffers">
      <wsdl:input message="tns:SearchOffersRequest">
    </wsdl:input>
      <wsdl:output message="tns:SearchOffersResponse">
    </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="availableSeats">
      <wsdl:input message="tns:AvailableSeatsRequest">
    </wsdl:input>
      <wsdl:output message="tns:AvailableSeatsResponse">
    </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="cancelPurchase">
      <wsdl:input message="tns:CancelPurchaseMessage">
    </wsdl:input>
    </wsdl:operation>
    <wsdl:operation name="purchaseOffer">
      <wsdl:input message="tns:PurchaseOfferRequest">
    </wsdl:input>
      <wsdl:output message="tns:PurchaseOfferResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="AirCompanyPortSOAPBinding" type="tns:AirCompanyPort">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="confirmPurchase">
      <soap:operation soapAction="confirmPurchase" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="searchOffers">
      <soap:operation soapAction="searchOffers" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="availableSeats">
      <soap:operation soapAction="availableSeats" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="cancelPurchase">
      <soap:operation soapAction="cancelPurchase" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="purchaseOffer">
      <soap:operation soapAction="purchaseOffer" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="AirCompanyPortService">
    <wsdl:port name="AirCompanyPortServicePort" binding="tns:AirCompanyPortSOAPBinding">
      <soap:address location="localhost:5010"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
